#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository_tf["gcp-network"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.env.base.tftpl
            
            DOCKER_NAME=arrow-tf-gcp-network
            TF_PROJECT=network
            TF_OWNER=devops
            TF_PREFIX=arw
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-network"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-network"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-network"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-network"].github_repository_file.files[".make/terraform.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
          - TF_IMAGE_NAME ?= hashicorp/terraform
          - TF_IMAGE_TAG  ?= latest
          + JQ                             := $(shell command -v jq 2> /dev/null)
          + TF_STATE_FILE                  := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
          + TF_IMAGE_NAME                  ?= arrow-tfenv
          + TF_IMAGE_TAG                   ?= v3.0.0-v1.4.2
          + TF_WORKSPACE                   ?= default
          + GOOGLE_APPLICATION_CREDENTIALS ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
          + TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
          + 
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
          - 	--name=$(DOCKER_NAME)-$@ \
          - 	--workdir=/opt/ \
          - 	--rm \
          - 	--user `id -u`:`id -g` \
          - 	-v "$(SOURCE_PATH)/src/:/opt/" \
          - 	-v "$(HOME)/.terraform.d:/opt/.terraform.d" \
          - 	-e "TF_CLI_CONFIG_FILE=/opt/.terraform.d/credentials.tfrc.json" \
          - 	-e "TF_IN_AUTOMATION=true" \
          - 	-e "TF_WORKSPACE=$(TF_WORKSPACE)" \
          - 	-t $(TF_IMAGE_NAME):$(TF_IMAGE_TAG) \
          - 	$(1) $(2)
          +        --name=${DOCKER_NAME}-$@ \
          +        --workdir=/opt/ \
          +        --rm \
          +        --user `id -u`:`id -g` \
          +        -v "${SOURCE_PATH}/src/:/opt/" \
          +        -v "${GOOGLE_APPLICATION_CREDENTIALS}:/opt/credentials.json" \
          +        -e "GOOGLE_APPLICATION_CREDENTIALS=/opt/credentials.json" \
          +        -e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com" \
          +        -e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
          +        -e "TF_IN_AUTOMATION=true" \
          +        -e "TF_WORKSPACE=${TF_WORKSPACE}" \
          +        -e "TF_STATE_BUCKET=${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate" \
          +        -e "TF_VAR_tf_project=${TF_PROJECT}" \
          +        -t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
          +        $(1) $(2)
            
          + # function to call init and providing a reason why init is needed
          + define call_init
          + 	echo "$(1)"
          + 	$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
          + endef
          + 
          + # Check if we need to run init, call_init when needed
          + ifeq ("$(wildcard $(TF_STATE_FILE))", "")
          + define check_init
          + 	$(call run_init, "No state file found, need init")
          + endef
          + else
          + 	ifdef JQ
          + define check_init
          + 	CONFIGURED_STATE_BUCKET=$(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
          + 	CONFIGURED_BACKEND_TYPE=$(shell jq -r '.backend.type' < ${TF_STATE_FILE})
          + 	$(if $(findstring,"$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,"State file $(CONFIGURED_BACKEND_TYPE) always run init"),$(if $(findstring,"$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),0,$(call run_init,"Backend bucket mismatch in jq test (\"$(CONFIGURED_STATE_BUCKET)\" != \"$(TF_STATE_BUCKET)\")\ need to run init")))
          + endef
          + 	else
          + define check_init
          + 	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,"Backend bucket mismatch in grep test"))
          + endef
          + 	endif
          + endif
          + 
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan'"
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-test"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
          + tf-validate-%: TF_WORKSPACE=$*
          + tf-validate-%: tf-docker-pull
          + 	@$(call check_init)
          + 	@echo "$(CYAN)Running terraform validate...$(SGR0)"
          + 	@$(call tf_run,validate)
          + 
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
          - 	@$(call tf_run,init)
          + 	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
          + 	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-test
        EOT
        id                  = "tf-gcp-network/.make/terraform.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["gcp-network"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
          - DOCKER_NAME := arrow-tf-gcp-network
          + include .make/env.mk
          + export
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig .help-terraform
          + help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tf-gcp-network/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["gcp-organization"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.env.base.tftpl
            
            DOCKER_NAME=arrow-tf-gcp-organization
            TF_PROJECT=org
            TF_OWNER=devops
            TF_PREFIX=arw
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-organization"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-organization"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-organization"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-organization"].github_repository_file.files[".make/terraform.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
          - TF_IMAGE_NAME ?= hashicorp/terraform
          - TF_IMAGE_TAG  ?= latest
          + JQ                             := $(shell command -v jq 2> /dev/null)
          + TF_STATE_FILE                  := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
          + TF_IMAGE_NAME                  ?= arrow-tfenv
          + TF_IMAGE_TAG                   ?= v3.0.0-v1.4.2
          + TF_WORKSPACE                   ?= default
          + GOOGLE_APPLICATION_CREDENTIALS ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
          + TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
          + 
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
          - 	--name=$(DOCKER_NAME)-$@ \
          - 	--workdir=/opt/ \
          - 	--rm \
          - 	--user `id -u`:`id -g` \
          - 	-v "$(SOURCE_PATH)/src/:/opt/" \
          - 	-v "$(HOME)/.terraform.d:/opt/.terraform.d" \
          - 	-e "TF_CLI_CONFIG_FILE=/opt/.terraform.d/credentials.tfrc.json" \
          - 	-e "TF_IN_AUTOMATION=true" \
          - 	-e "TF_WORKSPACE=$(TF_WORKSPACE)" \
          - 	-t $(TF_IMAGE_NAME):$(TF_IMAGE_TAG) \
          - 	$(1) $(2)
          +        --name=${DOCKER_NAME}-$@ \
          +        --workdir=/opt/ \
          +        --rm \
          +        --user `id -u`:`id -g` \
          +        -v "${SOURCE_PATH}/src/:/opt/" \
          +        -v "${GOOGLE_APPLICATION_CREDENTIALS}:/opt/credentials.json" \
          +        -e "GOOGLE_APPLICATION_CREDENTIALS=/opt/credentials.json" \
          +        -e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com" \
          +        -e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
          +        -e "TF_IN_AUTOMATION=true" \
          +        -e "TF_WORKSPACE=${TF_WORKSPACE}" \
          +        -e "TF_STATE_BUCKET=${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate" \
          +        -e "TF_VAR_tf_project=${TF_PROJECT}" \
          +        -t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
          +        $(1) $(2)
            
          + # function to call init and providing a reason why init is needed
          + define call_init
          + 	echo "$(1)"
          + 	$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
          + endef
          + 
          + # Check if we need to run init, call_init when needed
          + ifeq ("$(wildcard $(TF_STATE_FILE))", "")
          + define check_init
          + 	$(call run_init, "No state file found, need init")
          + endef
          + else
          + 	ifdef JQ
          + define check_init
          + 	CONFIGURED_STATE_BUCKET=$(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
          + 	CONFIGURED_BACKEND_TYPE=$(shell jq -r '.backend.type' < ${TF_STATE_FILE})
          + 	$(if $(findstring,"$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,"State file $(CONFIGURED_BACKEND_TYPE) always run init"),$(if $(findstring,"$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),0,$(call run_init,"Backend bucket mismatch in jq test (\"$(CONFIGURED_STATE_BUCKET)\" != \"$(TF_STATE_BUCKET)\")\ need to run init")))
          + endef
          + 	else
          + define check_init
          + 	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,"Backend bucket mismatch in grep test"))
          + endef
          + 	endif
          + endif
          + 
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan'"
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-test"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
          + tf-validate-%: TF_WORKSPACE=$*
          + tf-validate-%: tf-docker-pull
          + 	@$(call check_init)
          + 	@echo "$(CYAN)Running terraform validate...$(SGR0)"
          + 	@$(call tf_run,validate)
          + 
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
          - 	@$(call tf_run,init)
          + 	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
          + 	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-test
        EOT
        id                  = "tf-gcp-organization/.make/terraform.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["gcp-organization"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
          - DOCKER_NAME := arrow-tf-gcp-organization
          + include .make/env.mk
          + export
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig .help-terraform
          + help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tf-gcp-organization/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["gcp-projects"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.env.base.tftpl
            
            DOCKER_NAME=arrow-tf-gcp-projects
            TF_PROJECT=org
            TF_OWNER=devops
            TF_PREFIX=arw
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-projects"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-projects"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-projects"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-projects"].github_repository_file.files[".make/terraform.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
          - TF_IMAGE_NAME ?= hashicorp/terraform
          - TF_IMAGE_TAG  ?= latest
          + JQ                             := $(shell command -v jq 2> /dev/null)
          + TF_STATE_FILE                  := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
          + TF_IMAGE_NAME                  ?= arrow-tfenv
          + TF_IMAGE_TAG                   ?= v3.0.0-v1.4.2
          + TF_WORKSPACE                   ?= default
          + GOOGLE_APPLICATION_CREDENTIALS ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
          + TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
          + 
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
          - 	--name=$(DOCKER_NAME)-$@ \
          - 	--workdir=/opt/ \
          - 	--rm \
          - 	--user `id -u`:`id -g` \
          - 	-v "$(SOURCE_PATH)/src/:/opt/" \
          - 	-v "$(HOME)/.terraform.d:/opt/.terraform.d" \
          - 	-e "TF_CLI_CONFIG_FILE=/opt/.terraform.d/credentials.tfrc.json" \
          - 	-e "TF_IN_AUTOMATION=true" \
          - 	-e "TF_WORKSPACE=$(TF_WORKSPACE)" \
          - 	-t $(TF_IMAGE_NAME):$(TF_IMAGE_TAG) \
          - 	$(1) $(2)
          +        --name=${DOCKER_NAME}-$@ \
          +        --workdir=/opt/ \
          +        --rm \
          +        --user `id -u`:`id -g` \
          +        -v "${SOURCE_PATH}/src/:/opt/" \
          +        -v "${GOOGLE_APPLICATION_CREDENTIALS}:/opt/credentials.json" \
          +        -e "GOOGLE_APPLICATION_CREDENTIALS=/opt/credentials.json" \
          +        -e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com" \
          +        -e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
          +        -e "TF_IN_AUTOMATION=true" \
          +        -e "TF_WORKSPACE=${TF_WORKSPACE}" \
          +        -e "TF_STATE_BUCKET=${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate" \
          +        -e "TF_VAR_tf_project=${TF_PROJECT}" \
          +        -t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
          +        $(1) $(2)
            
          + # function to call init and providing a reason why init is needed
          + define call_init
          + 	echo "$(1)"
          + 	$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
          + endef
          + 
          + # Check if we need to run init, call_init when needed
          + ifeq ("$(wildcard $(TF_STATE_FILE))", "")
          + define check_init
          + 	$(call run_init, "No state file found, need init")
          + endef
          + else
          + 	ifdef JQ
          + define check_init
          + 	CONFIGURED_STATE_BUCKET=$(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
          + 	CONFIGURED_BACKEND_TYPE=$(shell jq -r '.backend.type' < ${TF_STATE_FILE})
          + 	$(if $(findstring,"$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,"State file $(CONFIGURED_BACKEND_TYPE) always run init"),$(if $(findstring,"$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),0,$(call run_init,"Backend bucket mismatch in jq test (\"$(CONFIGURED_STATE_BUCKET)\" != \"$(TF_STATE_BUCKET)\")\ need to run init")))
          + endef
          + 	else
          + define check_init
          + 	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,"Backend bucket mismatch in grep test"))
          + endef
          + 	endif
          + endif
          + 
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan'"
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-test"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
          + tf-validate-%: TF_WORKSPACE=$*
          + tf-validate-%: tf-docker-pull
          + 	@$(call check_init)
          + 	@echo "$(CYAN)Running terraform validate...$(SGR0)"
          + 	@$(call tf_run,validate)
          + 
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
          - 	@$(call tf_run,init)
          + 	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
          + 	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-test
        EOT
        id                  = "tf-gcp-projects/.make/terraform.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["gcp-projects"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
          - DOCKER_NAME := arrow-tf-gcp-projects
          + include .make/env.mk
          + export
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig .help-terraform
          + help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tf-gcp-projects/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["gcp-services-app"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "tf-gcp-services-app"
    }

  # module.repository_tf["gcp-services-app"].github_branch_protection.all["*"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "tf-gcp-services-app"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_tf["gcp-services-app"].github_branch_protection.all["**/**"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "**/**"
      + repository_id                   = "tf-gcp-services-app"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_tf["gcp-services-app"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "tf-gcp-services-app"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_tf["gcp-services-app"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Terraform - GCP Services App infra management"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tf-gcp-services-app"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".commitlintrc.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT
      + file                = ".commitlintrc.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - 'node_modules'
              - 'build'
              - '*.css'
              - '*.svg'
              - '*/**Makefile'
              - 'target'
              - 'out'
              - 'coverage'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.env.base.tftpl
            
            DOCKER_NAME=arrow-tf-gcp-services-app
            TF_PROJECT=app
            TF_OWNER=services
            TF_PREFIX=arw
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".github/workflows/terraform.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.github/workflows/terraform.yml
            #
            name: "Terraform"
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              terraform:
                name: "Terraform"
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
                  contents: read
                defaults:
                  run:
                    working-directory: src
                concurrency:
                  group: terraform-${{ github.head_ref || 'main' }}
                steps:
                  - name: Checkout
                    uses: actions/checkout@v3
            
                  - name: Setup Terraform
                    uses: hashicorp/setup-terraform@v2
                    with:
                      cli_config_credentials_token: ${{ secrets.TF_CLOUD_TOKEN }}
                      terraform_version: 1.3.6
            
                  - name: Terraform Format
                    id: fmt
                    run: terraform fmt -check
            
                  - name: Terraform Init
                    id: init
                    run: terraform init
            
                  - name: Terraform Validate
                    id: validate
                    run: terraform validate -no-color
            
                  - name: Terraform Plan
                    id: plan
                    if: github.event_name == 'pull_request'
                    run: |
                      terraform plan -no-color -lock=false -input=false -out tf.plan
                    continue-on-error: true
            
                  - name: Terraform Plan Show
                    id: planshow
                    if: github.event_name == 'pull_request'
                    run: |
                      terraform show -no-color tf.plan
            
                  - name: Add PR comment with plan output
                    uses: actions/github-script@v6
                    if: github.event_name == 'pull_request'
                    env:
                      PLAN: "terraform\n${{ steps.planshow.outputs.stdout }}"
                    with:
                      github-token: ${{ secrets.GITHUB_TOKEN }}
                      script: |
                        // 1. Retrieve existing bot comments for the PR
                        const { data: comments } = await github.rest.issues.listComments({
                          owner: context.repo.owner,
                          repo: context.repo.repo,
                          issue_number: context.issue.number,
                        })
                        const botComment = comments.find(comment => {
                          return comment.user.type === 'Bot' && comment.body.includes('Terraform Format and Style')
                        })
            
                        // 2. Prepare format of the comment
                        const output = `#### Terraform Format and Style 🖌\`${{ steps.fmt.outcome }}\`
                        #### Terraform Initialization ⚙️\`${{ steps.init.outcome }}\`
                        #### Terraform Validation 🤖\`${{ steps.validate.outcome }}\`
                        <details><summary>Validation Output</summary>
            
                        \`\`\`
                        ${{ steps.validate.outputs.stdout }}
                        \`\`\`
            
                        </details>
            
                        #### Terraform Plan 📖\`${{ steps.plan.outcome }}\`
            
                        <details><summary>Show Plan</summary>
            
                        \`\`\`
                        ${process.env.PLAN}
                        \`\`\`
            
                        </details>
            
                        *Pusher: @${{ github.actor }}, Action: \`${{ github.event_name }}\`, Working Directory: \`${{ env.tf_actions_working_dir }}\`, Workflow: \`${{ github.workflow }}\`*`;
            
                        // 3. If we have a comment, update it, otherwise create a new one
                        if (botComment) {
                          github.rest.issues.updateComment({
                            owner: context.repo.owner,
                            repo: context.repo.repo,
                            comment_id: botComment.id,
                            body: output
                          })
                        } else {
                          github.rest.issues.createComment({
                            issue_number: context.issue.number,
                            owner: context.repo.owner,
                            repo: context.repo.repo,
                            body: output
                          })
                        }
                    continue-on-error: true
            
                  - name: Terraform Plan Status
                    if: steps.plan.outcome == 'failure' && !contains(github.event.head_commit.message, 'provisioned by terraform')
                    run: exit 1
            
                  - name: Terraform Apply
                    if: github.ref == 'refs/heads/main' && github.event_name == 'push' && !contains(github.event.head_commit.message, 'provisioned by terraform')
                    run: terraform apply -auto-approve -input=false
        EOT
      + file                = ".github/workflows/terraform.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.gitignore
            
            # Terraform cache files
            */.terraform/**
            terraform.tfstate*
            
            # Don't add vscode or idea meta files
            .vscode
            .idea
            
            # Don't add DS_Store
            .DS_Store
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/base.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.1
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT
      + file                = ".make/base.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/commitlint.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT
      + file                = ".make/commitlint.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/cspell.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT
      + file                = ".make/cspell.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/editorconfig.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT
      + file                = ".make/editorconfig.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/markdown.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:stable \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT
      + file                = ".make/markdown.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files[".make/terraform.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
            JQ                             := $(shell command -v jq 2> /dev/null)
            TF_STATE_FILE                  := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
            TF_IMAGE_NAME                  ?= arrow-tfenv
            TF_IMAGE_TAG                   ?= v3.0.0-v1.4.2
            TF_WORKSPACE                   ?= default
            GOOGLE_APPLICATION_CREDENTIALS ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
            TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
                   --name=${DOCKER_NAME}-$@ \
                   --workdir=/opt/ \
                   --rm \
                   --user `id -u`:`id -g` \
                   -v "${SOURCE_PATH}/src/:/opt/" \
                   -v "${GOOGLE_APPLICATION_CREDENTIALS}:/opt/credentials.json" \
                   -e "GOOGLE_APPLICATION_CREDENTIALS=/opt/credentials.json" \
                   -e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com" \
                   -e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
                   -e "TF_IN_AUTOMATION=true" \
                   -e "TF_WORKSPACE=${TF_WORKSPACE}" \
                   -e "TF_STATE_BUCKET=${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate" \
                   -e "TF_VAR_tf_project=${TF_PROJECT}" \
                   -t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
                   $(1) $(2)
            
            # function to call init and providing a reason why init is needed
            define call_init
            	echo "$(1)"
            	$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            endef
            
            # Check if we need to run init, call_init when needed
            ifeq ("$(wildcard $(TF_STATE_FILE))", "")
            define check_init
            	$(call run_init, "No state file found, need init")
            endef
            else
            	ifdef JQ
            define check_init
            	CONFIGURED_STATE_BUCKET=$(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
            	CONFIGURED_BACKEND_TYPE=$(shell jq -r '.backend.type' < ${TF_STATE_FILE})
            	$(if $(findstring,"$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,"State file $(CONFIGURED_BACKEND_TYPE) always run init"),$(if $(findstring,"$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),0,$(call run_init,"Backend bucket mismatch in jq test (\"$(CONFIGURED_STATE_BUCKET)\" != \"$(TF_STATE_BUCKET)\")\ need to run init")))
            endef
            	else
            define check_init
            	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,"Backend bucket mismatch in grep test"))
            endef
            	endif
            endif
            
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan'"
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-test"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
            tf-validate-%: TF_WORKSPACE=$*
            tf-validate-%: tf-docker-pull
            	@$(call check_init)
            	@echo "$(CYAN)Running terraform validate...$(SGR0)"
            	@$(call tf_run,validate)
            
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
            	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
            	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-test
        EOT
      + file                = ".make/terraform.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files["CONTRIBUTING.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT
      + file                = "CONTRIBUTING.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
            include .make/env.mk
            export
            
            help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_file.init will be created
  + resource "github_repository_file" "init" {
      + branch              = "main"
      + commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository tf-gcp-services-app
        EOT
      + file                = ".terraform_init"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-gcp-services-app"
      + sha                 = (known after apply)
    }

  # module.repository_tf["gcp-services-app"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "tf-gcp-services-app"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_tf["gcp-services-app"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "tf-gcp-services-app"
      + team_id    = "services"
    }

  # module.repository_tf["github"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.env.base.tftpl
            
            DOCKER_NAME=arrow-tf-github
            TF_PROJECT=github
            TF_OWNER=devops
            TF_PREFIX=arw
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-github"
      + sha                 = (known after apply)
    }

  # module.repository_tf["github"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-github"
      + sha                 = (known after apply)
    }

  # module.repository_tf["github"].github_repository_file.files[".make/terraform.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
          - TF_IMAGE_NAME ?= hashicorp/terraform
          - TF_IMAGE_TAG  ?= latest
          + JQ                             := $(shell command -v jq 2> /dev/null)
          + TF_STATE_FILE                  := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
          + TF_IMAGE_NAME                  ?= arrow-tfenv
          + TF_IMAGE_TAG                   ?= v3.0.0-v1.4.2
          + TF_WORKSPACE                   ?= default
          + GOOGLE_APPLICATION_CREDENTIALS ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
          + TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
          + 
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
          - 	--name=$(DOCKER_NAME)-$@ \
          - 	--workdir=/opt/ \
          - 	--rm \
          - 	--user `id -u`:`id -g` \
          - 	-v "$(SOURCE_PATH)/src/:/opt/" \
          - 	-v "$(HOME)/.terraform.d:/opt/.terraform.d" \
          - 	-e "TF_CLI_CONFIG_FILE=/opt/.terraform.d/credentials.tfrc.json" \
          - 	-e "TF_IN_AUTOMATION=true" \
          - 	-e "TF_WORKSPACE=$(TF_WORKSPACE)" \
          - 	-t $(TF_IMAGE_NAME):$(TF_IMAGE_TAG) \
          - 	$(1) $(2)
          +        --name=${DOCKER_NAME}-$@ \
          +        --workdir=/opt/ \
          +        --rm \
          +        --user `id -u`:`id -g` \
          +        -v "${SOURCE_PATH}/src/:/opt/" \
          +        -v "${GOOGLE_APPLICATION_CREDENTIALS}:/opt/credentials.json" \
          +        -e "GOOGLE_APPLICATION_CREDENTIALS=/opt/credentials.json" \
          +        -e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com" \
          +        -e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
          +        -e "TF_IN_AUTOMATION=true" \
          +        -e "TF_WORKSPACE=${TF_WORKSPACE}" \
          +        -e "TF_STATE_BUCKET=${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate" \
          +        -e "TF_VAR_tf_project=${TF_PROJECT}" \
          +        -t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
          +        $(1) $(2)
            
          + # function to call init and providing a reason why init is needed
          + define call_init
          + 	echo "$(1)"
          + 	$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
          + endef
          + 
          + # Check if we need to run init, call_init when needed
          + ifeq ("$(wildcard $(TF_STATE_FILE))", "")
          + define check_init
          + 	$(call run_init, "No state file found, need init")
          + endef
          + else
          + 	ifdef JQ
          + define check_init
          + 	CONFIGURED_STATE_BUCKET=$(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
          + 	CONFIGURED_BACKEND_TYPE=$(shell jq -r '.backend.type' < ${TF_STATE_FILE})
          + 	$(if $(findstring,"$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,"State file $(CONFIGURED_BACKEND_TYPE) always run init"),$(if $(findstring,"$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),0,$(call run_init,"Backend bucket mismatch in jq test (\"$(CONFIGURED_STATE_BUCKET)\" != \"$(TF_STATE_BUCKET)\")\ need to run init")))
          + endef
          + 	else
          + define check_init
          + 	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,"Backend bucket mismatch in grep test"))
          + endef
          + 	endif
          + endif
          + 
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan'"
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-test"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
          + tf-validate-%: TF_WORKSPACE=$*
          + tf-validate-%: tf-docker-pull
          + 	@$(call check_init)
          + 	@echo "$(CYAN)Running terraform validate...$(SGR0)"
          + 	@$(call tf_run,validate)
          + 
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
          - 	@$(call tf_run,init)
          + 	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
          + 	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-test
        EOT
        id                  = "tf-github/.make/terraform.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["github"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
          - DOCKER_NAME := arrow-tf-github
          + include .make/env.mk
          + export
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig .help-terraform
          + help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tf-github/Makefile"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["onboarding"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/.env.base.tftpl
            
            DOCKER_NAME=arrow-tf-onboarding
            TF_PROJECT=onboarding
            TF_OWNER=devops
            TF_PREFIX=arw
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-onboarding"
      + sha                 = (known after apply)
    }

  # module.repository_tf["onboarding"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tf-onboarding"
      + sha                 = (known after apply)
    }

  # module.repository_tf["onboarding"].github_repository_file.files[".make/terraform.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
          - TF_IMAGE_NAME ?= hashicorp/terraform
          - TF_IMAGE_TAG  ?= latest
          + JQ                             := $(shell command -v jq 2> /dev/null)
          + TF_STATE_FILE                  := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
          + TF_IMAGE_NAME                  ?= arrow-tfenv
          + TF_IMAGE_TAG                   ?= v3.0.0-v1.4.2
          + TF_WORKSPACE                   ?= default
          + GOOGLE_APPLICATION_CREDENTIALS ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
          + TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
          + 
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
          - 	--name=$(DOCKER_NAME)-$@ \
          - 	--workdir=/opt/ \
          - 	--rm \
          - 	--user `id -u`:`id -g` \
          - 	-v "$(SOURCE_PATH)/src/:/opt/" \
          - 	-v "$(HOME)/.terraform.d:/opt/.terraform.d" \
          - 	-e "TF_CLI_CONFIG_FILE=/opt/.terraform.d/credentials.tfrc.json" \
          - 	-e "TF_IN_AUTOMATION=true" \
          - 	-e "TF_WORKSPACE=$(TF_WORKSPACE)" \
          - 	-t $(TF_IMAGE_NAME):$(TF_IMAGE_TAG) \
          - 	$(1) $(2)
          +        --name=${DOCKER_NAME}-$@ \
          +        --workdir=/opt/ \
          +        --rm \
          +        --user `id -u`:`id -g` \
          +        -v "${SOURCE_PATH}/src/:/opt/" \
          +        -v "${GOOGLE_APPLICATION_CREDENTIALS}:/opt/credentials.json" \
          +        -e "GOOGLE_APPLICATION_CREDENTIALS=/opt/credentials.json" \
          +        -e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com" \
          +        -e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
          +        -e "TF_IN_AUTOMATION=true" \
          +        -e "TF_WORKSPACE=${TF_WORKSPACE}" \
          +        -e "TF_STATE_BUCKET=${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate" \
          +        -e "TF_VAR_tf_project=${TF_PROJECT}" \
          +        -t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
          +        $(1) $(2)
            
          + # function to call init and providing a reason why init is needed
          + define call_init
          + 	echo "$(1)"
          + 	$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
          + endef
          + 
          + # Check if we need to run init, call_init when needed
          + ifeq ("$(wildcard $(TF_STATE_FILE))", "")
          + define check_init
          + 	$(call run_init, "No state file found, need init")
          + endef
          + else
          + 	ifdef JQ
          + define check_init
          + 	CONFIGURED_STATE_BUCKET=$(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
          + 	CONFIGURED_BACKEND_TYPE=$(shell jq -r '.backend.type' < ${TF_STATE_FILE})
          + 	$(if $(findstring,"$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,"State file $(CONFIGURED_BACKEND_TYPE) always run init"),$(if $(findstring,"$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),0,$(call run_init,"Backend bucket mismatch in jq test (\"$(CONFIGURED_STATE_BUCKET)\" != \"$(TF_STATE_BUCKET)\")\ need to run init")))
          + endef
          + 	else
          + define check_init
          + 	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,"Backend bucket mismatch in grep test"))
          + endef
          + 	endif
          + endif
          + 
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan'"
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-test"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
          + tf-validate-%: TF_WORKSPACE=$*
          + tf-validate-%: tf-docker-pull
          + 	@$(call check_init)
          + 	@echo "$(CYAN)Running terraform validate...$(SGR0)"
          + 	@$(call tf_run,validate)
          + 
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
          - 	@$(call tf_run,init)
          + 	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
          + 	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-test
        EOT
        id                  = "tf-onboarding/.make/terraform.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_tf["onboarding"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
          - DOCKER_NAME := arrow-tf-onboarding
          + include .make/env.mk
          + export
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig .help-terraform
          + help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tf-onboarding/Makefile"
        # (7 unchanged attributes hidden)
    }

Plan: 35 to add, 10 to change, 0 to destroy.

```

</details>

*Pusher: @owlot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*